{
  "films": [
    {
      "id": 0,
      "title": "Jumanji",
      "description": "Robin Williams stars as Alan Parrish, who, after 25 years, is finally freed from the spell of an ancient magical board game named JUMANJI. The two children who freed him, however, have unleashed a group of wild and exotic creatures from the game, forcing the long-lost Alan to save his hometown from destruction",
      "year": "1995",
      "poster": "https://upload.wikimedia.org/wikipedia/en/b/b6/Jumanji_poster.jpg"
    },
    {
      "id": 1,
      "title": "Jumanji: Welcome to the Jungle",
      "description": "Four teenagers in detention discover an old video game console with a game they’ve never heard of. When they decide to play, they are immediately sucked into the jungle world of Jumanji in the bodies of their avatars (Dwayne Johnson, Jack Black, Kevin Hart, and Karen Gillan). They’ll have to complete the adventure of their lives filled with fun, thrills and danger or be stuck in the game forever!",
      "year": "2017",
      "poster": "https://upload.wikimedia.org/wikipedia/en/d/dc/Jumanji_Welcome_to_the_Jungle.png"
    },
    {
      "id": 2,
      "title": "Jumanji: The Next Level",
      "description": "In Jumanji:The Next Level, the gang is back (Dwayne Johnson, Jack Black, Kevin Hart and Karen Gillan) but the game has changed. As they return to Jumanji to rescue one of their own, they discover that nothing is as they expect. With more action and surprises, the players will have to brave parts unknown and unexplored, from the arid deserts to the snowy mountains, in order to escape.",
      "year": "2019",
      "poster": "https://upload.wikimedia.org/wikipedia/en/3/3c/JumanjiTheNextLevelTeaserPoster.jpg"
    },
    {
      "id": 5,
      "title": "Ocean’s 8",
      "description": "Five years, eight months, 12 days...and counting. That’s how long Debbie Ocean (Sandra Bullock) has been devising the biggest heist of her life. She knows what it’s going to take—a team of the best in their field, starting with her partner-in-crime Lou Miller (Cate Blanchett). Together, they recruit a crew of specialists: jeweler Amita (Mindy Kaling); street con Constance (Awkwafina); expert fence Tammy (Sarah Paulson); hacker Nine Ball (Rihanna); and fashion designer Rose (Helena Bonham Carter). The target is a cool $150 million dollars in diamonds—diamonds that will be around the neck of world-famous actress Daphne Kluger (Anne Hathaway), who will be centerstage at the event of the year, the Met Gala. The plan is rock solid, but everything will need to be flawless if the team is going to get in and get away with the ice. All in plain sight.",
      "year": "2018",
      "poster": "https://upload.wikimedia.org/wikipedia/en/d/dd/OceansEightPoster.jpeg"
    },
    {
      "id": 8,
      "title": "Rise of the Guardians",
      "description": "A fun-filled magical story about the legendary guardians– Jack Frost (Chris Pine), the Easter Bunny (Hugh Jackman), Santa Claus, and the Tooth Fairy- together for the first time! When the evil boogeyman Pitch (Jude Law) threatens to take over the world, it’s up to our beloved heroes to protect the hopes and dreams of all children. It’s a dazzling and heartwarming family film.",
      "year": "2012",
      "poster": "https://upload.wikimedia.org/wikipedia/en/9/92/Rise_of_the_Guardians_poster.jpg"
    },
    {
      "id": 9,
      "title": "Onward",
      "description": "In a suburban fantasy world, two teenage elf brothers, Ian and Barley Lightfoot, go on a journey to discover if there is still a little magic left out there in order to spend one last day with their father, who died when they were too young to remember him.",
      "year": "2020",
      "poster": "https://upload.wikimedia.org/wikipedia/en/0/03/Onward_poster.jpg"
    },
    {
      "id": 10,
      "title": "Star Wars: The Force Awakens",
      "description": "Visionary director J.J. Abrams brings to life the motion picture event of a generation. As Kylo Ren and the sinister First Order rise from the ashes of the Empire, Luke Skywalker is missing when the galaxy needs him most. It’s up to Rey, a desert scavenger, and Finn, a defecting stormtrooper, to join forces with Han Solo and Chewbacca in a desperate search for the one hope of restoring peace to the galaxy.",
      "year": "2015",
      "poster": "https://upload.wikimedia.org/wikipedia/en/a/a2/Star_Wars_The_Force_Awakens_Theatrical_Poster.jpg"
    },
    {
      "id": 11,
      "title": "Star Wars: The Last Jedi",
      "description": "Rey develops her newly-discovered abilities with the guidance of Luke Skywalker, who is unsettled by the strength of her powers. Meanwhile, the Resistance prepare to do battle with the First Order.",
      "year": "2017",
      "poster": "https://upload.wikimedia.org/wikipedia/en/7/7f/Star_Wars_The_Last_Jedi.jpg"
    },
    {
      "id": 12,
      "title": "Star Wars: The Rise of Skywalker",
      "description": "Finn and Poe lead the Resistance to put a stop to the First Order’s plans to form a new Empire, while Rey anticipates her inevitable confrontation with Kylo Ren.",
      "year": "2019",
      "poster": "https://upload.wikimedia.org/wikipedia/en/a/af/Star_Wars_The_Rise_of_Skywalker_poster.jpg"
    },
    {
      "id": 13,
      "title": "Rogue One: A Star Wars Story",
      "description": "Unlikely heroes band together to steal the plans to the Death Star.",
      "year": "2016",
      "poster": "https://upload.wikimedia.org/wikipedia/en/d/d4/Rogue_One%2C_A_Star_Wars_Story_poster.png"
    },
    {
      "id": 15,
      "title": "Captain Marvel",
      "description": "Marvel Studios’ Captain Marvel takes you on a spectacular adventure from the 1990s, tracing the path of Carol Danvers (Brie Larson) as she becomes one of the most powerful heroes in the universe. When a galactic war reaches Earth, she meets young agent Nick Fury (Samuel L. Jackson) at the center of a maelstrom, leading to her ultimate destiny as an Avenger!",
      "year": "2019",
      "poster": "https://upload.wikimedia.org/wikipedia/en/4/4e/Captain_Marvel_%28film%29_poster.jpg"
    },
    {
      "id": 16,
      "title": "Wonder Woman",
      "description": "Before she was Wonder Woman, she was Diana, princess of the Amazons, trained to be an unconquerable warrior. Raised on a sheltered island paradise, when an American pilot crashes on their shores and tells of a massive conflict raging in the outside world, Diana leaves her home, convinced she can stop the threat. Fighting alongside men in a war to end all wars, Diana will discover her full powers and her true destiny.",
      "year": "2017",
      "poster": "https://upload.wikimedia.org/wikipedia/en/b/b0/Wonder_Woman_%282017_film%29_poster.jpg"
    },
    {
      "id": 17,
      "title": "Collateral Beauty",
      "description": "When a successful New York ad executive suffers a personal tragedy and retreats from life, his friends devise a drastic plan to reach him before he loses everything. Pushing him to the very edge, they force him to confront the truth in surprising and profoundly human ways. From Oscar-winning director David Frankel, this thought-provoking drama explores how even the deepest tragedy can reveal moments of beauty, and how the constants of love, time and loss interlock in a life fully lived.",
      "year": "2016",
      "poster": "https://upload.wikimedia.org/wikipedia/en/9/90/Collateral_Beauty_poster.png"
    },
    {
      "id": 18,
      "title": "Alice in Wonderland",
      "description": "19-year-old Alice returns to the whimsical world of her youth.",
      "year": "2010",
      "poster": "https://upload.wikimedia.org/wikipedia/en/3/36/Alice_in_Wonderland_%282010_film%29.png"
    },
    {
      "id": 19,
      "title": "Alice Through the Looking Glass",
      "description": "Alice (Mia Wasikowska) has spent the past few years following in her father’s footsteps and sailing the high seas. Upon her return to London, she comes across a magical looking glass and returns to the fantastical realm of Underland and her friends. There she discovers that the Mad Hatter (Johnny Depp) has lost his Muchness, so the White Queen (Anne Hathaway) sends her on a quest to borrow the Chronosphere, a metallic globe inside the chamber of the Grand Clock that powers all time. Returning to the past, she embarks on a perilous race to save the Hatter before time runs out.",
      "year": "2016",
      "poster": "https://upload.wikimedia.org/wikipedia/en/1/15/Alice_Through_the_Looking_Glass_%282016_film%29_poster.png"
    },
    {
      "id": 21,
      "title": "The Nice Guys",
      "description": "Private eye Holland March and muscle-for-hire Jackson Healy are plunged into a life-or-death mystery when the missing persons case they’re both following leads them to a conspiracy involving people at the highest levels.",
      "year": "2016",
      "poster": "https://upload.wikimedia.org/wikipedia/en/e/e9/The_Nice_Guys_poster.png"
    },
    {
      "id": 22,
      "title": "The Kitchen",
      "description": "Based on the Vertigo comic book series from DC Entertainment, the film stars Oscar nominee Melissa McCarthy, Tiffany Haddish and Elisabeth Moss as three 1978 Hell’s Kitchen housewives whose mobster husbands are sent to prison by the FBI. Left with little but a sharp ax to grind, the ladies take the Irish mafia’s matters into their own hands—proving unexpectedly adept at everything from running the rackets to taking out the competition…literally.",
      "year": "2019",
      "poster": "https://upload.wikimedia.org/wikipedia/en/5/5c/The_Kitchen_poster.jpeg"
    },
    {
      "id": "7acb05c3-de81-4f0e-a8af-3bc151e26919",
      "title": "The Hunger Games",
      "year": "2012",
      "poster": "https://upload.wikimedia.org/wikipedia/en/4/42/HungerGamesPoster.jpg",
      "description": "Based on the best-selling books by Suzanne Collins, THE HUNGER GAMES is the first film in the franchise. Every year in the ruins of what was once North America, the Capitol of the nation of Panem forces each of its twelve districts to send a teenage boy and girl to compete in the Hunger Games. Sixteen year old Katniss Everdeen volunteers in her younger sister's place and must rely upon her sharp instincts when she's pitted against highly trained Tributes who have prepared their entire lives. If she's ever to return home to District 12, Katniss must make impossible choices in the arena that weigh survival against humanity and life against love."
    },
    {
      "id": "7cca534a-d4b8-4599-943a-69ebbc4b3704",
      "title": "The Hunger Games: Catching Fire",
      "year": "2013",
      "poster": "https://upload.wikimedia.org/wikipedia/en/1/12/Catching-Fire_poster.jpg",
      "description": "Academy Award® winner Jennifer Lawrence returns as Katniss Everdeen in this thrilling second adventure from THE Hunger Games saga. Against all odds, Katniss and fellow tribute Peeta have returned home after surviving the Hunger Games. Winning means they must leave loved ones behind and embark on a Victory Tour through the districts. Along the way, Katniss senses a rebellion simmering – one that she and Peeta may have sparked. At the end of the tour, President Snow announces a deadly 75th Hunger Games that could change Panem forever."
    },
    {
      "id": "8fffd928-55c7-4237-8aea-c0ce6bc05e4f",
      "title": "The Hunger Games: Mockingjay – Part 1",
      "year": "2014",
      "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/6/63/MockingjayPart1Poster3.jpg/220px-MockingjayPart1Poster3.jpg",
      "description": "Katniss Everdeen [Jennifer Lawrence], girl on fire, is rescued by the rebels and brought to District 13 after she shatters the games forever. Under the leadership of President Coin [Julianne Moore] and Plutarch Heavensbee [Philip Seymour Hoffman], Katniss spreads her wings and becomes The Mockingjay, the symbolic leader of the rebellion. But President Snow has his own plans for her - and her loved ones."
    },
    {
      "id": "b25ac70d-d5ac-4b4b-9cdd-3ed1f45486ee",
      "title": "The Hunger Games: Mockingjay – Part 2",
      "year": "2015",
      "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/9/9d/Mockingjay_Part_2_Poster.jpg/220px-Mockingjay_Part_2_Poster.jpg",
      "description": "One of the most celebrated movie series of all time comes to its thrilling conclusion in the last chapter of The Hunger Games. Jennifer Lawrence stars as Katniss Everdeen, who began her journey fighting to survive the brutal Hunger Games, and rose to lead the rebellion against Panem's tyrannical president [Donald Sutherland]. Now, Katniss and a team of rebels from District 13 prepare for the final epic battle that will decide Panem's future."
    },
    {
      "id": "b15f423d-e3d1-409f-ae0f-ab6a9bc2b439",
      "title": "The Lord of the Rings: The Fellowship of the Ring",
      "year": "2001",
      "poster": "https://upload.wikimedia.org/wikipedia/en/8/8a/The_Lord_of_the_Rings_The_Fellowship_of_the_Ring_%282001%29.jpg",
      "description": "“One ring to rule them all. One ring to find them. One ring to bring them all and in the darkness bind them.” J.R.R. Tolkien The Lord of the Rings In the first part of J.R.R. Tolkien’s epic masterpiece, The Lord of the Rings, a shy young hobbit named Frodo Baggins inherits a simple gold ring. He knows the ring has power, but not that he alone holds the secret to the survival – or enslavement – of the entire world. Now Frodo, accompanied by a wizard, an elf, a dwarf, two men and three loyal hobbit friends, must become the greatest hero the world has ever known to save the land and the people he loves."
    },
    {
      "id": "67566e2c-267d-4d74-b659-9bc720230d0d",
      "title": "The Lord of the Rings: The Two Towers",
      "year": "2002",
      "poster": "https://upload.wikimedia.org/wikipedia/en/d/d0/Lord_of_the_Rings_-_The_Two_Towers_%282002%29.jpg",
      "description": "In the part second of the Tolkien trilogy, Frodo Baggins and the other members of the Fellowship continue on their sacred quest to destroy the One Ring – but on separate paths. Their destinies lie at two towers – Orthanc Tower in Isengard, where the corrupt wizard Saruman awaits, and Sauron’s fortress at Barad-dur, deep within the dark lands of Mordor."
    },
    {
      "id": "e30325e3-deb7-444b-8a3d-619c879541b1",
      "title": "The Lord of the Rings: The Return of the King",
      "year": "2003",
      "poster": "https://upload.wikimedia.org/wikipedia/en/b/be/The_Lord_of_the_Rings_-_The_Return_of_the_King_%282003%29.jpg",
      "description": "In the conclusion of J.R.R. Tolkien’s epic masterpiece, The Lord of the Rings, as armies mass for a final battle that will decide the fate of the world – and powerful, ancient forces of Light and Dark compete to determine the outcome – one member of the Fellowship of the Ring is revealed as the noble heir to the throne of the Kings of Men. Yet, the sole hope for triumph over evil lies with a brave hobbit, Frodo, who, accompanied only by his loyal friend Sam and the hideous, wretched Gollum, ventures deep into the very dark heart of Mordor on his seemingly impossible quest to destroy the Ring of Power."
    },
    {
      "id": "c3f195e6-fbe1-461b-9d2a-5b94a860885b",
      "title": "The Hobbit: An Unexpected Journey",
      "year": "2012",
      "poster": "https://upload.wikimedia.org/wikipedia/en/b/b3/The_Hobbit-_An_Unexpected_Journey.jpeg",
      "description": "Set in Middle Earth 60 years before the epic Lord of the Rings trilogy, the adventure follows the journey of Bilbo Baggins, who is swept into an epic quest to reclaim the lost Dwarf Kingdom from the fearsome dragon Smaug. Approached out of the blue by the wizard Gandalf, Bilbo finds himself joining a company of dwarves on a journey into wild, treacherous lands swarming with beasts of every ilk. Although their goal lies to the East, they must first escape the goblin tunnels, where Bilbo meets the creature that will change his life forever"
    },
    {
      "id": "4363710f-2563-4644-802e-9fdaa1c35c03",
      "title": "The Hobbit: The Desolation of Smaug",
      "year": "2013",
      "poster": "https://upload.wikimedia.org/wikipedia/en/4/4f/The_Hobbit_-_The_Desolation_of_Smaug_theatrical_poster.jpg",
      "description": "Academy Award® winner Peter Jackson continues his Middle-earth adventure following Bilbo Baggins (Martin Freeman) who’s swept into an epic quest to reclaim the lost Dwarf Kingdom of Erebor from the fearsome dragon Smaug. In the company of thirteen dwarves and the wizard Gandalf the Grey (Ian McKellen), Bilbo enters the Lonely Mountain in possession of Gollum’s “precious” ring and his keen blade, Sting. With an all-star cast and the effects wizardry of Jackson’s award-winning Weta Workshop, Tolkien’s epic story comes to life as never before imagined."
    },
    {
      "id": "3da59f12-06a6-4d37-8113-e3871a98a016",
      "title": "The Hobbit: The Battle of the Five Armies",
      "year": "2014",
      "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/e/e7/The_Hobbit_-_The_Battle_of_the_Five_Armies.png/220px-The_Hobbit_-_The_Battle_of_the_Five_Armies.png",
      "description": "Set in Middle-earth 60 years before the epic Lord of the Rings trilogy, the adventure follows the journey of Bilbo Baggins, who is swept into an epic quest to reclaim the lost Dwarf Kingdom from the fearsome dragon Smaug. Approached out of the blue by the wizard Gandalf, Bilbo finds himself joining a company of dwarves on a journey into wild, treacherous lands swarming with beasts of every ilk. After reaching Erebor and encountering the dragon Smaug, Five Armies assemble for an epic battle that could decide the future of all in Middle-earth."
    },
    {
      "id": "82483cda-2eee-4519-bbb9-a42a626ffddb",
      "title": "The Lord of the Rings: The Rings of Power",
      "year": "2022",
      "poster": "https://encrypted-tbn2.gstatic.com/images?q=tbn:ANd9GcSYePau2d1foYT_KGcCIqR9ZNbBnYm7oRAtL4ZNVU6NdfMgZbau",
      "description": "Set thousands of years before the events of The Hobbit and The Lord of the Rings, the series is based on author J.R.R. Tolkien’s history of Middle-earth. It begins during a time of relative peace and covers all the major events of Middle-earth’s Second Age: the forging of the Rings of Power, the rise of the Dark Lord Sauron, the fall of the island kingdom of Númenor, and the last alliance between Elves and Men. These events take place over thousands of years in Tolkien’s original stories but are condensed for the series."
    },
    {
      "id": "4aaa2fa6-c318-47f5-be1a-d6551621784b",
      "title": "The Spy Who Dumped Me",
      "year": "2018",
      "poster": "https://upload.wikimedia.org/wikipedia/en/2/25/The_Spy_Who_Dumped_Me.png",
      "description": "In Los Angeles, Audrey Stockman spends her birthday party upset after being unexpectedly dumped by her boyfriend Drew via text. Her best friend and roommate, Morgan, convinces her to burn Drew’s belongings and informs him also via text message. Unbeknownst to Audrey, Drew is a government agent, currently in Vilnius being pursued by armed men. He calls Audrey, promising to return for his things, including a fantasy football trophy."
    },
    {
      "id": "16935ccb-d8fc-4b06-b458-5de2a06569c5",
      "title": "Ghostbusters",
      "year": "2016",
      "poster": "https://upload.wikimedia.org/wikipedia/en/3/32/Ghostbusters_2016_film_poster.png",
      "description": "Ghostbusters makes its long-awaited return, rebooted with a cast of hilarious new characters. Thirty years after the beloved original franchise took the world by storm, director Paul Feig brings his fresh take to the supernatural comedy, joined by some of the funniest actors working today – Melissa McCarthy, Kristen Wiig, Kate McKinnon, Leslie Jones, and Chris Hemsworth. This summer, they’re here to save the world!"
    },
    {
      "id": "227c807a-75dc-4112-9640-89e5eb3908fd",
      "title": "Arrival",
      "year": "2016",
      "poster": "https://upload.wikimedia.org/wikipedia/en/d/df/Arrival%2C_Movie_Poster.jpg",
      "description": "When mysterious spacecraft touch down across the globe, an elite team – led by expert linguist Louise Banks (Amy Adams) – are brought together to investigate. As mankind teeters on the verge of global war, Banks and the team race against time for answers – and to find them, she will take a chance that could threaten her life, and quite possibly humanity."
    },
    {
      "id": "cbac1b8f-08a9-480f-a900-21576e11847b",
      "title": "The Bourne Legacy",
      "year": "2012",
      "poster": "https://upload.wikimedia.org/wikipedia/en/4/4c/The_Bourne_Legacy_Poster.jpg",
      "description": "Agent Aaron Cross (Jeremy Renner) must use his genetically-enhanced skills to finish what Jason Bourne started in this action-packed hit that takes the Bourne series to explosive new levels."
    },
    {
      "id": "7c378197-e9d7-41b5-acba-4c17cdfc506e",
      "title": "Wind River",
      "year": "2017",
      "poster": "https://upload.wikimedia.org/wikipedia/en/2/2e/Wind_River_%282017_film%29.png",
      "description": "During the winter on Wyoming's Wind River Indian Reservation, U.S. Fish and Wildlife Service Agent Cory Lambert discovers the frozen body of 18-year-old Natalie Hanson. FBI Special Agent Jane Banner arrives to investigate the possible homicide. Banner learns from Natalie's father Martin that his daughter was dating a new boyfriend who is unknown to him. Natalie's autopsy shows signs of blunt trauma and rape, and confirms Lambert's deduction that Natalie died from pulmonary hemorrhage caused by inhaling subzero air. The medical examiner is unable to classify the death as a homicide, so Banner cannot get additional help from her supervisors. "
    },
    {
      "id": "e4d798ef-6a64-467c-b88f-a9afd887e825",
      "title": "Elysium",
      "year": "2013",
      "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/f/f9/Elysium_Poster.jpg/220px-Elysium_Poster.jpg",
      "description": "In the year 2154, two classes of people exist: the very wealthy, who live on a pristine man-made space station called Elysium, and the rest, who live on an overpopulated, ruined Earth. Secretary Delacourt (Jodie Foster) will stop at nothing to preserve the luxurious lifestyle of the citizens of Elysium – but that doesn’t stop the people of Earth from trying to get in by any means they can. Max (Matt Damon) agrees to take on a life threatening mission, one that could bring equality to these polarized worlds."
    },
    {
      "id": "594236d2-7e94-4f69-997e-72221dc5fb9b",
      "title": "Terminator Genisys",
      "year": "2019",
      "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/b/bc/Terminator_Genisys.JPG/220px-Terminator_Genisys.JPG",
      "description": "In 2029, Human Resistance leader John Connor launches a final offensive against Skynet, an artificial general intelligence system seeking to eliminate the human race. Before the Resistance can triumph, Skynet activates a time machine and sends a T-800/Model 101 Terminator back to 1984, to kill John’s mother Sarah. John’s right-hand man, Kyle Reese, volunteers to travel back in time to protect her. As Kyle floats in the machine’s magnetic field, he sees John being attacked by another Resistance soldier. This creates a temporal paradox that alters the timeline and causes Kyle to experience childhood memories from a parallel version of himself."
    },
    {
      "id": "1935cb7f-08ca-45d4-afc9-d84b8bfd2547",
      "title": "Terminator: Dark Fate",
      "year": "2019",
      "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/5/5f/Terminator_Dark_Fate_poster.jpg/220px-Terminator_Dark_Fate_poster.jpg",
      "description": "Decades after Sarah Connor (Linda Hamilton) prevented Judgment Day, a lethal new Terminator is sent to eliminate the future leader of the resistance. In a fight to save mankind, battle-hardened Sarah Connor teams up with an unexpected ally (Arnold Schwarzenegger) and an enhanced super soldier to stop the deadliest Terminator yet. Humanity’s fate hangs in the balance in this action-packed thrill ride from Tim Miller, the Director of Deadpool, and Producer James Cameron."
    },
    {
      "id": "10184c4c-1211-46a8-9fb0-f4ab45bcfa7c",
      "title": "Proof",
      "year": "2005",
      "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/1/1f/Proof_poster.jpg/220px-Proof_poster.jpg",
      "description": "The plot alternates between events immediately following the death of Robert, a brilliant mathematician at the University of Chicago whose genius was undone by crippling mental illness, and flashbacks revealing the life he shared with his daughter Catherine. Catherine is also a mathematician and was once a promising student at Northwestern University, but she struggles with living in her father’s shadow and balancing her demanding studies with caring for her father, as well as the fear that she may have inherited his mental illness. At home, Robert clings to sanity by constantly bombarding Catherine with complex mathematical problems."
    },
    {
      "id": "6c214812-372b-4165-92fd-673fcf39fbd0",
      "title": "My Blueberry Nights",
      "year": "2007",
      "poster": "https://upload.wikimedia.org/wikipedia/en/9/95/My_Blueberry_Nights_poster.jpg",
      "description": "Jeremy, an émigré from Manchester, owns a small New York City café. It becomes a haven for Elizabeth, as he provides her with clues which soon reveal that her boyfriend is cheating on her. Devastated, she leaves, but returns for solace and to share stories. Jeremy explains his bowl of keys, and the story behind each, while she gluttonously eats his blueberry pie until she falls asleep. He tries to steal a kiss while Elizabeth sleeps, and she pretends to continue sleeping. But after the kiss she subtly smiles, but he doesn’t see it. Elizabeth leaves Jeremy’s café and he puts the key to her and her ex’s in the key bowl."
    },
    {
      "id": "e55a6108-2d40-4713-933c-3b72b50f011f",
      "title": "Music and Lyrics",
      "year": "2007",
      "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/d/d3/Music_and_lyrics.jpg/220px-Music_and_lyrics.jpg",
      "description": "Alex Fletcher is a washed-up former pop star (from the British group ‘PoP!’) who seems happy in his “has-been” status, performing for 80s-loving fans at reunions and random locations, when his manager tells him Cora Corman, a young megastar, wants him to write a song for her, titled “A Way Back Into Love”. Alex is reluctant to compose again after two decades, because his strength was always the tune, his ex-partner Colin always wrote the words. However, his caring but professional manager tells him that his music career is completely doomed if he doesn’t switch gears—interest in his nostalgia concerts is dwindling."
    },
    {
      "id": "4835bab1-6594-453a-87ac-352be87b6565",
      "title": "Red Dragon",
      "year": "2002",
      "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/b/bd/Red_Dragon_movie.jpg/220px-Red_Dragon_movie.jpg",
      "description": "In 1980, FBI agent Will Graham visits forensic psychiatrist Hannibal Lecter to discuss a case. Graham has been working with Lecter on a psychological profile of a serial killer who removes edible body parts from his victims; Graham says he has realized the killer is a cannibal. Realizing Graham is close to discovering he is the killer, Lecter stabs him, but Graham fights back, stabbing and shooting Lecter before they both fall unconscious. Lecter is imprisoned in an institution for the criminally insane, and Graham, traumatized, retires to Florida with his family."
    },
    {
      "id": "f832904e-8daf-445a-be31-6c45a355518e",
      "title": "The Silence of the Lambs",
      "year": "1991",
      "poster": "https://upload.wikimedia.org/wikipedia/en/8/86/The_Silence_of_the_Lambs_poster.jpg",
      "description": "In 1990, Clarice Starling is pulled from her FBI training at the Quantico, Virginia FBI Academy by Jack Crawford of the Bureau’s Behavioral Science Unit. He assigns her to interview Hannibal Lecter, a former psychiatrist and incarcerated cannibalistic serial killer. Crawford believes Lecter’s insight could prove useful in the pursuit of a psychopath serial killer nicknamed “Buffalo Bill”, who kills young women and removes their skin from their bodies."
    },
    {
      "id": "6498c035-de1d-4d34-a8d0-088aabd6d1f9",
      "title": "Hannibal",
      "year": "2001",
      "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/9/9b/Hannibal_movie_poster.jpg/220px-Hannibal_movie_poster.jpg",
      "description": "A decade after tracking down serial killer Jame Gumb, FBI Special Agent Clarice Starling is blamed for a botched drug raid which resulted in the deaths of six people. Starling is contacted by Mason Verger, the only surviving victim of the cannibalistic serial killer Hannibal Lecter, who has been missing since escaping custody during the Gumb investigation. A wealthy child molester, Verger was paralyzed and disfigured by Lecter during a therapy session. He has been pursuing an elaborate scheme to capture, torture, and kill Lecter ever since. Using his wealth and political influence, Verger has Starling reassigned to Lecter’s case, hoping her involvement will draw Lecter out."
    },
    {
      "id": "81e35a99-30f3-438e-a53e-15d32a9a0a33",
      "title": "The Raven",
      "year": "2012",
      "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/4/4b/The_Raven_Poster.jpg/220px-The_Raven_Poster.jpg",
      "description": "In 19th-century Baltimore, Maryland, several policemen discover a murdered woman sprawled on the floor of her apartment, which was locked from the inside. While police search for the killer’s means of escape, they discover a second corpse in the chimney, later identified as the 12-year-old daughter of the first victim. A celebrated detective, Emmett Fields, is called to assist in the investigation and discovers that the crime resembles a fictional murder in a short story, “The Murders in the Rue Morgue”, that he once read."
    },
    {
      "id": "e823dfde-30c3-48dc-869e-e222847095fa",
      "title": "The Woman in White",
      "year": "2018",
      "poster": "https://upload.wikimedia.org/wikipedia/en/thumb/c/cf/The_Woman_in_White_%282018_TV_series%29.jpg/250px-The_Woman_in_White_%282018_TV_series%29.jpg",
      "description": "Walter Hartright receives a letter from Frederick Fairlie requesting that he restore his art collection and tutor his nieces at Limmeridge House in Cumberland. Before he leaves for Cumberland, he meets a woman dressed in white, who tells him she used to live at Limmeridge. Shortly afterwards the woman rushes away and boards a coach. Some time later Walter overhears a conversation between a policeman and a coach passenger suggesting that the woman is deranged and has escaped from an asylum."
    },
    {
      "id": "5995289a-00f7-47df-966c-bd281b3233d0",
      "title": "The Girl Before",
      "year": "2021",
      "poster": "https://fr.web.img6.acsta.net/r_1280_720/pictures/22/01/25/09/48/2669680.jpg",
      "description": "A traumatised woman falls in love with an extraordinary minimalist house, which remains under the spell of the architect who originally designed it, but not everything may be as it seems."
    }
  ],
  "users": [
    {
      "id": "1",
      "email": "someone@gmail.com",
      "password": "987654321",
      "name": "",
      "avatar": ""
    },
    {
      "id": 1669745314521,
      "email": "someone@gmail.com",
      "password": "987654321",
      "name": "",
      "avatar": ""
    },
    {
      "id": 1669745353198,
      "email": "harrypotter@op.pl",
      "password": "harrypotter",
      "name": "",
      "avatar": ""
    },
    {
      "id": 1669824576452,
      "email": "guardian@gmail.com",
      "password": "toothfairy",
      "name": "",
      "avatar": ""
    },
    {
      "id": 1669826015118,
      "email": "mycat@dog.com",
      "password": "catsanddogs",
      "name": "",
      "avatar": ""
    },
    {
      "id": 1669834298279,
      "email": "winniethepooh@disney.com",
      "password": "redtshirt",
      "name": "",
      "avatar": ""
    },
    {
      "id": 1670176029174,
      "email": "myemail@gmail.com",
      "password": "myPassword",
      "name": "",
      "avatar": ""
    }
  ]
}